---
kind: method
id: M:Autodesk.Revit.DB.ScheduleFieldId.op_Inequality(Autodesk.Revit.DB.ScheduleFieldId,Autodesk.Revit.DB.ScheduleFieldId)
source: html/1a494d8c-0734-ea7a-3a93-b603374dc32f.htm
---
# Autodesk.Revit.DB.ScheduleFieldId.op_Inequality Method

Determines whether two ScheduleFieldId are different.

## Syntax (C#)
```csharp
public static bool operator !=(
	ScheduleFieldId first,
	ScheduleFieldId second
)
```

## Parameters
- **first** (`Autodesk.Revit.DB.ScheduleFieldId`) - The first ScheduleFieldId.
- **second** (`Autodesk.Revit.DB.ScheduleFieldId`) - The second ScheduleFieldId.

## Returns
True if the ScheduleFieldId are different, otherwise false.